app/controllers/plants_controller.rb

SELECT * FROM `plants`
---
  def index
    @plants = Plant.all

SELECT * FROM `plants` WHERE (`plants`.`id` = 1)
---
  def show
    @plant = Plant.find(params[:id])

INSERT INTO `plants` (`updated_at`, `common_name`, `sowing_depth`, `desc`, `yield_worth`, `bot_name`, `spacing`, `created_at`) VALUES('2009-04-16 20:37:20', 'Corn', NULL, '', NULL, '', NULL, '2009-04-16 20:37:20')
---
  def create
    @plant = Plant.new(params[:plant])

    respond_to do |format|
      if @plant.save